#### 📖 Terraform Plan ('src/common/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_web_app.portal_backend_1: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_04: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [20s elapsed]
data.azurerm_linux_web_app.sign_backoffice_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [20s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [30s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.app_messages_xl[1]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.app_messages_xl[0]: Still reading... [10s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [40s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [20s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.app_backend_weu["2"].data.
Error: Linux App Service (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-cgn-be-rg"
Site Name: "io-p-cgn-fn") not found

  with data.azurerm_linux_function_app.function_cgn,
  on data.tf line 74, in data "azurerm_linux_function_app" "function_cgn":
  74: data "azurerm_linux_function_app" "function_cgn" {

Linux App Service (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-cgn-be-rg"
Site Name: "io-p-cgn-fn") not found

Error: reading Auth Settings for Linux App Service (Subscription: "74da48a3-b0e7-489d-8172-da79801086ed"
Resource Group Name: "cgnonboardingportal-p-api-rg"
Site Name: "cgnonboardingportal-p-portal-backend1"): unexpected status 403 (403 Forbidden) with error: AuthorizationFailed: The client '8d5d04c7-98f7-4f27-91ae-249231d96918' with object id '8d5d04c7-98f7-4f27-91ae-249231d96918' does not have authorization to perform action 'Microsoft.Web/sites/config/list/action' over scope '/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/cgnonboardingportal-p-api-rg/providers/Microsoft.Web/sites/cgnonboardingportal-p-portal-backend1/config/authsettings' or the scope is invalid. If access was recently granted, please refresh your credentials.

  with data.azurerm_linux_web_app.portal_backend_1,
  on iam.tf line 32, in data "azurerm_linux_web_app" "portal_backend_1":
  32: data "azurerm_linux_web_app" "portal_backend_1" {

reading Auth Settings for Linux App Service (Subscription:
"74da48a3-b0e7-489d-8172-da79801086ed"
Resource Group Name: "cgnonboardingportal-p-api-rg"
Site Name: "cgnonboardingportal-p-portal-backend1"): unexpected status 403
(403 Forbidden) with error: AuthorizationFailed: The client
'8d5d04c7-98f7-4f27-91ae-249231d96918' with object id
'8d5d04c7-98f7-4f27-91ae-249231d96918' does not have authorization to perform
action 'Microsoft.Web/sites/config/list/action' over scope
'/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/cgnonboardingportal-p-api-rg/providers/Microsoft.Web/sites/cgnonboardingportal-p-portal-backend1/config/authsettings'
or the scope is invalid. If access was recently granted, please refresh your
credentials.
data.azurerm_linux_function_app.function_profile[1]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile[0]: Still reading... [10s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [50s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [30s elapsed]
data.azurerm_linux_function_app.function_profile[1]: Still reading... [20s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [1m0s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [40s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [1m10s elapsed]
module.app_backend_li_weu.data.azurerm_key_vault_secret.app_backend_APP_MESSAGES_API_KEY[1]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [50s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [1m20s elapsed]
module.app_backend_li_weu.data.azurerm_key_vault_secret.app_backend_APP_MESSAGES_API_KEY[1]: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [1m0s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [1m30s elapsed]
module.app_backend_li_weu.data.azurerm_key_vault_secret.app_backend_APP_MESSAGES_API_KEY[1]: Still reading... [30s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [1m10s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [1m40s elapsed]
module.app_backend_li_weu.data.azurerm_key_vault_secret.app_backend_APP_MESSAGES_API_KEY[1]: Still reading... [40s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [1m20s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [1m50s elapsed]
module.app_backend_li_weu.data.azurerm_key_vault_secret.app_backend_APP_MESSAGES_API_KEY[1]: Still reading... [50s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [1m30s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [2m0s elapsed]
module.app_backend_li_weu.data.azurerm_key_vault_secret.app_backend_APP_MESSAGES_API_KEY[1]: Still reading... [1m0s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [1m40s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [2m10s elapsed]
module.app_backend_li_weu.data.azurerm_key_vault_secret.app_backend_APP_MESSAGES_API_KEY[1]: Still reading... [1m10s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [1m50s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [2m20s elapsed]
module.app_backend_li_weu.data.azurerm_key_vault_secret.app_backend_APP_MESSAGES_API_KEY[1]: Still reading... [1m20s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [2m0s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [2m30s elapsed]
module.app_backend_li_weu.data.azurerm_key_vault_secret.app_backend_APP_MESSAGES_API_KEY[1]: Still reading... [1m30s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [2m10s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [2m40s elapsed]
module.app_backend_li_weu.data.azurerm_key_vault_secret.app_backend_APP_MESSAGES_API_KEY[1]: Still reading... [1m40s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [2m20s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [2m50s elapsed]
module.app_backend_li_weu.data.azurerm_key_vault_secret.app_backend_APP_MESSAGES_API_KEY[1]: Still reading... [1m50s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [2m30s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [3m0s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [2m40s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [3m10s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [2m50s elapsed]
data.azurerm_linux_web_app.portal_backend_1: Still reading... [3m20s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [3m0s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # azuread_application.apim_client_app will be created
  + resource "azuread_application" "apim_client_app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "io-p-apim-api-management-client"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "8d5d04c7-98f7-4f27-91ae-249231d96918",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)

      + password (known after apply)
    }

  # azuread_application.dev_portal_app will be created
  + resource "azuread_application" "dev_portal_app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "io-prod-sp-developer-portal"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "8d5d04c7-98f7-4f27-91ae-249231d96918",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)

      + password (known after apply)
    }

  # azuread_service_principal.apim_client_svc will be created
  + resource "azuread_service_principal" "apim_client_svc" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "8d5d04c7-98f7-4f27-91ae-249231d96918",
        ]
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azuread_service_principal.dev_portal_svc will be created
  + resource "azuread_service_principal" "dev_portal_svc" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "8d5d04c7-98f7-4f27-91ae-249231d96918",
        ]
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  + resource "azurerm_role_assignment" "apim_client_role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.apim_client_role["Contributor"] will be created
  + resource "azurerm_role_assignment" "apim_client_role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "apim_client_role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "dev_portal_role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.dev_portal_role["Contributor"] will be created
  + resource "azurerm_role_assignment" "dev_portal_role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "dev_portal_role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.sign_backoffice_app_role will be created
  + resource "azurerm_role_assignment" "sign_backoffice_app_role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6fb591dc-9cd4-4d5a-8903-6389d96af660"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "API Management Service Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.staging_sign_backoffice_app_role will be created
  + resource "azurerm_role_assignment" "staging_sign_backoffice_app_role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c44b5cc2-8342-4403-adc7-56113a3b511f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "API Management Service Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.apim_itn.azurerm_key_vault_access_policy.apim_v2_kv_policy will be created
  + resource "azurerm_key_vault_access_policy" "apim_v2_kv_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-kv"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.apim_itn.azurerm_key_vault_access_policy.v2_common will be created
  + resource "azurerm_key_vault_access_policy" "v2_common" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.apim_itn.azurerm_network_security_group.apim will be created
  + resource "azurerm_network_security_group" "apim" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-apim-nsg-01"
      + resource_group_name = "io-p-itn-common-rg-01"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "managementapim"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "ApiManagement"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
    }

  # module.apim_itn.azurerm_public_ip.apim will be created
  + resource "azurerm_public_ip" "apim" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = "apimio"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "italynorth"
      + name                    = "io-p-itn-apim-pip-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.apim_itn.azurerm_subnet.apim will be created
  + resource "azurerm_subnet" "apim" {
      + address_prefixes                               = [
          + "10.20.100.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-apim-snet-01"
      + private_endpoint_network_policies              = "Enabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + service_endpoints                              = [
          + "Microsoft.Web",
        ]
      + virtual_network_name                           = "io-p-itn-common-vnet-01"
    }

  # module.apim_itn.azurerm_subnet_network_security_group_association.apim will be created
  + resource "azurerm_subnet_network_security_group_association" "apim" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.apim_itn.module.apim_v2.azurerm_api_management.this will be created
  + resource "azurerm_api_management" "this" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "italynorth"
      + management_api_url            = (known after apply)
      + name                          = "io-p-itn-apim-01"
      + notification_sender_email     = (sensitive value)
      + policy                        = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_address_id          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = true
      + publisher_email               = (sensitive value)
      + publisher_name                = "IO"
      + resource_group_name           = "io-p-itn-common-rg-01"
      + scm_url                       = (known after apply)
      + sku_name                      = "Premium_1"
      + tags                          = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + virtual_network_type          = "Internal"
      + zones                         = [
          + "1",
        ]

      + delegation (known after apply)

      + hostname_configuration (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + protocols (known after apply)

      + security (known after apply)

      + sign_in (known after apply)

      + sign_up (known after apply)

      + tenant_access (known after apply)

      + virtual_network_configuration {
          + subnet_id = (known after apply)
        }
    }

  # module.app_backend_weu["1"].module.appservice_app_backend_slot_staging.azurerm_linux_web_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "FF_IO_FIMS_ENABLED"                              = "1" -> "0"
            # (112 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl1/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_backend_weu["2"].module.appservice_app_backend_slot_staging.azurerm_linux_web_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "FF_IO_FIMS_ENABLED"                              = "1" -> "0"
            # (112 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl2/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_backend_weu["3"].module.appservice_app_backend_slot_staging.azurerm_linux_web_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "FF_IO_FIMS_ENABLED"                              = "1" -> "0"
            # (112 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl3/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 19 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app,
  on ../_modules/application_gateway/firewall.tf line 62, in resource "azurerm_web_application_firewall_policy" "api_app":
  62:         disabled_rules = [
  63:           "942100",
  64:           "942120",
  65:           "942190",
  66:           "942200",
  67:           "942210",
  68:           "942240",
  69:           "942250",
  70:           "942260",
  71:           "942330",
  72:           "942340",
  73:           "942370",
  74:           "942380",
  75:           "942430",
  76:           "942440",
  77:           "942450",
  78:         ]

`disabled_rules` will be removed in favour of the `rule` property in version
4.0 of the AzureRM Provider.

(and 53 more similar warnings elsewhere)
data.azurerm_linux_web_app.portal_backend_1: Still reading... [3m30s elapsed]
::error::Terraform exited with code 1.
```

</details>
